src/cf/InformationRegisters/НастройкаЗаполненияФормСтатистики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>НастройкаЗаполненияФормСтатистики</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заполнять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНаблюдения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтатистическогоНаблюдения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ЗадачиНачалаРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ЗадачиНачалаРаботы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СписокНалоговОтчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НастройкаЗаполненияФормСтатистики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подключение1СОтчетности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подключение1СЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДоступКОрганизациям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьРеквизитыОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьБыстрыйСтарт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьВидеоурок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПараметрыУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУчетнаяПолитика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьНачальныеОстатки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьНастройкаТорговыхТочек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатитьЗадолженностьПоНалогамВзносам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УказатьДатуПрекращенияДеятельности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ЗадачиБухгалтераКлиентСервер/Ext/Module.bsl
Функция Идентификатор(Имя) Экспорт
	
	Цифры = "1234567890";
	НомерСтрокой = "";
	ДлинаИмени = СтрДлина(Имя);
	Для Индекс = 0 По ДлинаИмени - 1 Цикл
		Позиция = ДлинаИмени - Индекс;
		Символ = Сред(Имя,Позиция,1);
		Если СтрНайти(Цифры, Символ) = 0 Тогда
			Прервать;
		КонецЕсли;
		НомерСтрокой = Символ + НомерСтрокой;
	КонецЦикла;
	
	Если ПустаяСтрока(НомерСтрокой) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Возврат Число(НомерСтрокой) - 1;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция НомерКонтейнера(Индекс) Экспорт
	
	Возврат Формат(Индекс + 1, "ЧГ=0");
	
КонецФункции

Функция СсылкаНаИТС(Срок = Неопределено) Экспорт
	
	Если Срок = Неопределено Тогда
		Параметры = "";
	Иначе
		Параметры = "/?date=" + Формат(Срок, "ДФ=yyyyMMdd");
	КонецЕсли;
	
	Возврат "http://its.1c.ru/calendar" + Параметры;
	
КонецФункции

Функция ОписаниеДействия(ПараметрыКоманды) Экспорт
	
	Если ТипЗнч(ПараметрыКоманды.Правило) = Тип("ПеречислениеСсылка.ЗадачиНачалаРаботы") Тогда
		
		Если ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.СписокНалоговОтчетов") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Организация", ПараметрыКоманды.Организация);
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("ИмяФормы",       "ОбщаяФорма.НалогиИОтчеты");
			ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
			
		ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.Подключение1СОтчетности") Тогда
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("Подключение1СОтчетности", Истина);
			ОписаниеДействия.Вставить("Организация", ПараметрыКоманды.Организация);
			
		ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.Подключение1СЭДО") Тогда
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("Подключение1СЭДО", Истина);
			ОписаниеДействия.Вставить("Организация", ПараметрыКоманды.Организация);
			
		ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.НастройкаЗаполненияФормСтатистики") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Организация", ПараметрыКоманды.Организация);
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("ИмяФормы",       "РегистрСведений.НастройкаЗаполненияФормСтатистики.Форма.НастройкаЗаполненияФормСтатистики");
			ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
			
		ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.ОплатитьЗадолженностьПоНалогамВзносам") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Организация", ПараметрыКоманды.Организация);
			ПараметрыФормы.Вставить("ОткрытаИзСпискаЗадач", Истина);
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("ИмяФормы",       "Обработка.ПомощникУплатыНалоговВзносовПрошлыхЛет.Форма.ФормаВводаНачальныхОстатковИнтеграцияСБанком");
			ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
			
		ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.УказатьДатуПрекращенияДеятельности") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", ПараметрыКоманды.Организация);
			ПараметрыФормы.Вставить("ОткрытаИзСпискаЗадач", Истина);
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("ИмяФормы",       "Справочник.Организации.Форма.ФормаОрганизации");
			ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли
		
	ИначеЕсли ТипЗнч(ПараметрыКоманды.Правило) = Тип("СправочникСсылка.ПроверкиКонтролирующимиОрганами") Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ",        ПараметрыКоманды.Правило);
		ПараметрыФормы.Вставить("Организация", ПараметрыКоманды.Организация);
		
		ОписаниеДействия = Новый Структура;
		ОписаниеДействия.Вставить("ИмяФормы",       "Справочник.ПроверкиКонтролирующимиОрганами.Форма.ФормаПросмотра");
		ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
		
	Иначе
		
		ОписаниеДействия = ВыполнениеЗадачБухгалтераВызовСервера.ОписаниеДействия(ПараметрыКоманды);
		
	КонецЕсли;
	
	Возврат ОписаниеДействия;
	
КонецФункции

Функция СрокПредупрежденияПриОграниченииСпособовОтправки() Экспорт
	
	Возврат 5; // 5 дней - достаточно дойти до учреждения или отправить почтой
	
КонецФункции

Функция ПредставлениеКомментария(СтатусУстановленВручную, Комментарий, ПользовательУстановившийСтатус) Экспорт
	
	Если Не СтатусУстановленВручную Тогда
		Возврат "";
	ИначеЕсли ЗначениеЗаполнено(Комментарий) И ЗначениеЗаполнено(ПользовательУстановившийСтатус) Тогда
		Возврат СтрШаблон("%1 (%2)", Комментарий, ПользовательУстановившийСтатус);
	ИначеЕсли ЗначениеЗаполнено(Комментарий) Тогда
		Возврат Комментарий;
	ИначеЕсли ЗначениеЗаполнено(ПользовательУстановившийСтатус) Тогда
		Возврат СтрШаблон("Статус установлен вручную пользователем %1", ПользовательУстановившийСтатус);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

#Область КодыЗадач

Функция КодЗадачиНДС() Экспорт
	
	Возврат "НДС";
	
КонецФункции

Функция КодЗадачиУСН() Экспорт
	
	Возврат "УСН";
	
КонецФункции

Функция КодЗадачиАУСН() Экспорт
	
	Возврат "АУСН";
	
КонецФункции

Функция КодЗадачиСтраховыеВзносыАУСН() Экспорт
	
	Возврат "СтраховыеВзносыАУСН";
	
КонецФункции

Функция КодЗадачиСтраховыеВзносы() Экспорт
	
	Возврат "СтраховыеВзносы";
	
КонецФункции

Функция КодПравилаОтчетаРасчетПоСтраховымВзносам() Экспорт
	Возврат "2023_ОтчетностьСтраховыеВзносы";
КонецФункции

Функция КодЗадачиСтраховыеВзносыИП() Экспорт
	
	Возврат "СтраховыеВзносы_Предприниматель";
	
КонецФункции

Функция КодЗадачиНДФЛ() Экспорт
	
	Возврат "НДФЛ";
	
КонецФункции

Функция КодПравилаНДФЛКонецМесяца() Экспорт
	
	Возврат "2024_НДФЛ_Уведомление_КонецМесяца";
	
КонецФункции

Функция КодЗадачиНалогНаПрибыль() Экспорт
	
	Возврат "НалогНаПрибыль";
	
КонецФункции

Функция КодЗадачиНДФЛПоУплате() Экспорт
	
	Возврат "НДФЛ_Агент_Уплата";
	
КонецФункции

Функция КодЗадачиНДФЛПоОтчету() Экспорт
	
	Возврат "НДФЛ_Агент";
	
КонецФункции

Функция КодЗадачиНДФЛПредприниматель() Экспорт
	
	Возврат "НДФЛ_Предприниматель";
	
КонецФункции

Функция КодЗадачиСреднесписочнаяЧисленность() Экспорт
	
	Возврат "СведенияОСреднесписочнойЧисленности";
	
КонецФункции

Функция КодЗадачиСтатистика() Экспорт
	
	Возврат "СтатистическаяОтчетность";
	
КонецФункции

Функция КодЗадачиПатент() Экспорт
	
	Возврат "Патент";
	
КонецФункции

Функция КодЗадачиЕНВД() Экспорт
	
	Возврат "ЕНВД";
	
КонецФункции

Функция КодЗадачиТорговыйСбор() Экспорт
	
	Возврат "ТорговыйСбор";
	
КонецФункции

Функция КодЗадачиНалогНаПрофессиональныйДоход() Экспорт
	
	Возврат "НалогНаПрофессиональныйДоход";
	
КонецФункции

Функция КодЗадачиБухгалтерскаяОтчетность() Экспорт
	
	Возврат "БухгалтерскаяОтчетность";
	
КонецФункции

Функция КодЗадачиНалогНаИмущество() Экспорт
	
	Возврат "НалогНаИмущество";
	
КонецФункции

Функция КодЗадачиТранспортныйНалог() Экспорт
	
	Возврат "ТранспортныйНалог";
	
КонецФункции

Функция КодЗадачиЗемельныйНалог() Экспорт
	
	Возврат "ЗемельныйНалог";
	
КонецФункции

Функция КодЗадачиСтраховыеВзносыИП_ВНиМ() Экспорт
	
	Возврат "2023_Уплата_ВНиМ";
	
КонецФункции

Функция ПолноеИмяПравилаСтраховыеВзносыИП_ВНиМ() Экспорт
	
	Возврат СтрШаблон("%1.%2", КодЗадачиСтраховыеВзносыИП(), КодЗадачиСтраховыеВзносыИП_ВНиМ());
	
КонецФункции

#КонецОбласти
